## *Load both transformed files into:Parquet*

# 1.*transformed_Full files*

In [6]:
import pandas as pd

### *Step 1: Read the Full Transformed Dataset*

In [ ]:
# Load the full transformed dataset
transformed_full = pd.read_csv('transformed/transformed_full.csv')
# Verify successful loading
transformed_full.head()

,order_id,customer_name,product,quantity,unit_price,order_date,region,month,total_price,revenue_category
0,1,Diana,Tablet,2,500.0,2024-01-20,South,1,1000.0,High
1,3,Charlie,Laptop,2,250.0,2024-01-08,Not Specified,1,500.0,Medium
2,4,Eve,Laptop,2,750.0,2024-01-07,West,1,1500.0,Very High
3,5,Eve,Tablet,3,625.0,2024-03-07,South,3,1875.0,Very High
4,7,Charlie,Monitor,2,750.0,2024-02-02,West,2,1500.0,Very High



*We begin the Load phase by reading the fully transformed CSV file into pandas using a clear and descriptive variable name (`transformed_full`).  
The `.head()` preview confirms successful loading and verifies that the dataset is ready for the next step.*

## *Step 2: Load transformed_full as Parquet*

In [10]:
# Save the full dataset as a Parquet file
transformed_full.to_parquet('loaded/full_data.parquet', index=False, compression='snappy')

## *step-3 Preview the full_data results*

In [11]:
# Verify the saved file by reading it back
pd.read_parquet('loaded/full_data.parquet').head()

,order_id,customer_name,product,quantity,unit_price,order_date,region,month,total_price,revenue_category
0,1,Diana,Tablet,2,500.0,2024-01-20,South,1,1000.0,High
1,3,Charlie,Laptop,2,250.0,2024-01-08,Not Specified,1,500.0,Medium
2,4,Eve,Laptop,2,750.0,2024-01-07,West,1,1500.0,Very High
3,5,Eve,Tablet,3,625.0,2024-03-07,South,3,1875.0,Very High
4,7,Charlie,Monitor,2,750.0,2024-02-02,West,2,1500.0,Very High

### *Save Full Dataset to Parquet*

*The `transformed_full` DataFrame is written to `loaded/full_data.parquet` using Snappy compression.  
We immediately read it back with `pd.read_parquet().head()` to confirm that the write operation was successful and the file is usable for downstream processes.*

# 2.*transformed_Incremental files*

### *Step 1: Read the incremental Transformed Dataset*

In [12]:
# Save incremental DataFrame to Parquet
transformed_incremental = pd.read_csv('transformed/transformed_incremental.csv')

## *Step 2: Load transformed_incremetal as Parquet*

In [14]:
# Save the full dataset as a Parquet file
transformed_incremental.to_parquet('loaded/incremental_data.parquet',index=False,compression='snappy')

## *step-3 Preview the incremental_data results*

In [15]:
# Verify successful save
pd.read_parquet('loaded/incremental_data.parquet').head()

,order_id,customer_name,product,quantity,unit_price,order_date,region,month,total_price,revenue_category
0,101,Alice,Laptop,1,900.0,2024-05-09,Central,5,900.0,High
1,102,Unknown,Laptop,1,300.0,2024-05-07,Central,5,300.0,Medium
2,103,Unknown,Laptop,1,600.0,2024-05-04,Central,5,600.0,High
3,104,Unknown,Tablet,1,300.0,2024-05-26,Central,5,300.0,Medium
4,105,Heidi,Tablet,2,600.0,2024-05-21,North,5,1200.0,Very High

### *Step 3: Save Incremental Dataset to Parquet*

*The `transformed_incremental.csv` file is read into pandas and saved as a Snappy-compressed Parquet file (`incremental_data.parquet`) in the `loaded/` folder.*  
*Using `pd.read_parquet().head()` confirms that the file was written successfully and accurately.*